[Killed] PublicVisibility
Aplicacion/AutenticarCliente.php:13:5
         private RepositorioCliente $repositorio
     ) {}
 
-    public function ejecutar(AutenticarClientePeticion $peticion): array {
+    protected function ejecutar(AutenticarClientePeticion $peticion): array {
         $correo = new CorreoElectronico($peticion->correoElectronico);
         $cliente = $this->repositorio->buscarPorCorreoElectronico($correo);
killedBy: Tests\Cliente\Aplicacion\AutenticarClienteTest::test_debe_autenticar_exitosamente_y_retornar_arreglo
statusReason: 1) Tests\Cliente\Aplicacion\AutenticarClienteTest::test_debe_autenticar_exitosamente_y_retornar_arreglo
Error: Call to protected method App\Cliente\Aplicacion\AutenticarCliente::ejecutar() from scope Tests\Cliente\Aplicacion\AutenticarClienteTest

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Aplicacion\AutenticarClienteTest.php:53

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LogicalOr
Aplicacion/AutenticarCliente.php:17:9
         $correo = new CorreoElectronico($peticion->correoElectronico);
         $cliente = $this->repositorio->buscarPorCorreoElectronico($correo);
 
-        if ($cliente === null || !$cliente->obtenerContrasena()->verificar($peticion->contrasenaPlana)) {
+        if ($cliente === null && !$cliente->obtenerContrasena()->verificar($peticion->contrasenaPlana)) {
             throw new \RuntimeException("Las credenciales de acceso son incorrectas.");
         }
killedBy: Tests\Cliente\Aplicacion\AutenticarClienteTest::test_debe_lanzar_excepcion_si_el_usuario_no_existe
statusReason: 1) Tests\Cliente\Aplicacion\AutenticarClienteTest::test_debe_lanzar_excepcion_si_el_usuario_no_existe
Failed asserting that exception of type "Error" matches expected exception "RuntimeException". Message was: "Call to a member function obtenerContrasena() on null" at
C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Aplicacion\AutenticarCliente.php:17
C:\wamp64\www\Nueva carpeta\veterinaria\tes

[Killed] LogicalNot
Aplicacion/AutenticarCliente.php:17:9
         $correo = new CorreoElectronico($peticion->correoElectronico);
         $cliente = $this->repositorio->buscarPorCorreoElectronico($correo);
 
-        if ($cliente === null || !$cliente->obtenerContrasena()->verificar($peticion->contrasenaPlana)) {
+        if ($cliente === null || $cliente->obtenerContrasena()->verificar($peticion->contrasenaPlana)) {
             throw new \RuntimeException("Las credenciales de acceso son incorrectas.");
         }
killedBy: Tests\Cliente\Aplicacion\AutenticarClienteTest::test_debe_autenticar_exitosamente_y_retornar_arreglo
statusReason: 1) Tests\Cliente\Aplicacion\AutenticarClienteTest::test_debe_autenticar_exitosamente_y_retornar_arreglo
RuntimeException: Las credenciales de acceso son incorrectas.

C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Aplicacion\AutenticarCliente.php:18
C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Aplicacion\AutenticarClienteTest.php:53

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Throw_
Aplicacion/AutenticarCliente.php:18:13
         $cliente = $this->repositorio->buscarPorCorreoElectronico($correo);
 
         if ($cliente === null || !$cliente->obtenerContrasena()->verificar($peticion->contrasenaPlana)) {
-            throw new \RuntimeException("Las credenciales de acceso son incorrectas.");
+            new \RuntimeException("Las credenciales de acceso son incorrectas.");
         }
 
killedBy: Tests\Cliente\Aplicacion\AutenticarClienteTest::test_debe_lanzar_excepcion_si_el_usuario_no_existe
statusReason: 1) Tests\Cliente\Aplicacion\AutenticarClienteTest::test_debe_lanzar_excepcion_si_el_usuario_no_existe
Failed asserting that exception of type "Error" matches expected exception "RuntimeException". Message was: "Call to a member function mapearAArreglo() on null" at
C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Aplicacion\AutenticarCliente.php:21
C:\wamp64\www\Nueva carpeta\veterinaria\tests\
