[Killed] PublicVisibility
Aplicacion/EliminarCliente.php:13:5
         private RepositorioCliente $repositorio
     ) {}
 
-    public function ejecutar(int $clienteId): void {
+    protected function ejecutar(int $clienteId): void {
         $id = new ClienteId($clienteId);
         $cliente = $this->repositorio->buscarPorId($id);
killedBy: Tests\Cliente\Aplicacion\EliminarClienteTest::test_debe_eliminar_exitosamente_si_existe
statusReason: 1) Tests\Cliente\Aplicacion\EliminarClienteTest::test_debe_eliminar_exitosamente_si_existe
Error: Call to protected method App\Cliente\Aplicacion\EliminarCliente::ejecutar() from scope Tests\Cliente\Aplicacion\EliminarClienteTest

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Aplicacion\EliminarClienteTest.php:29

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Identical
Aplicacion/EliminarCliente.php:17:9
         $id = new ClienteId($clienteId);
         $cliente = $this->repositorio->buscarPorId($id);
 
-        if ($cliente === null) {
+        if ($cliente !== null) {
             // 💡 CORRECCIÓN: Cambiar "propietario" por "cliente"
             throw new \DomainException("No se puede eliminar: El cliente no existe.");
killedBy: Tests\Cliente\Aplicacion\EliminarClienteTest::test_debe_eliminar_exitosamente_si_existe
statusReason: 1) Tests\Cliente\Aplicacion\EliminarClienteTest::test_debe_eliminar_exitosamente_si_existe
DomainException: No se puede eliminar: El cliente no existe.

C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Aplicacion\EliminarCliente.php:19
C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Aplicacion\EliminarClienteTest.php:29

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Throw_
Aplicacion/EliminarCliente.php:19:13
 
         if ($cliente === null) {
             // 💡 CORRECCIÓN: Cambiar "propietario" por "cliente"
-            throw new \DomainException("No se puede eliminar: El cliente no existe.");
+            new \DomainException("No se puede eliminar: El cliente no existe.");
         }
 
killedBy: Tests\Cliente\Aplicacion\EliminarClienteTest::test_debe_fallar_al_eliminar_si_no_existe
statusReason: 1) Tests\Cliente\Aplicacion\EliminarClienteTest::test_debe_fallar_al_eliminar_si_no_existe
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] MethodCallRemoval
Aplicacion/EliminarCliente.php:22:9
             throw new \DomainException("No se puede eliminar: El cliente no existe.");
         }
 
-        $this->repositorio->eliminar($id);
+        
     }
 }
killedBy: Tests\Cliente\Aplicacion\EliminarClienteTest::test_debe_eliminar_exitosamente_si_existe
statusReason: 1) Tests\Cliente\Aplicacion\EliminarClienteTest::test_debe_eliminar_exitosamente_si_existe
Expectation failed for method name is "eliminar" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
