[Killed] PublicVisibility
Aplicacion/ListarCliente.php:15:5
         $this->repositorio = $repositorio;
     }
 
-    public function ejecutar(): array {
+    protected function ejecutar(): array {
         $clientesDominio = $this->repositorio->buscarTodos();
 
killedBy: Tests\Cliente\Aplicacion\ListarClienteTest::test_debe_retornar_un_arreglo_vacio_cuando_no_hay_clientes
statusReason: 1) Tests\Cliente\Aplicacion\ListarClienteTest::test_debe_retornar_un_arreglo_vacio_cuando_no_hay_clientes
Error: Call to protected method App\Cliente\Aplicacion\ListarCliente::ejecutar() from scope Tests\Cliente\Aplicacion\ListarClienteTest

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Aplicacion\ListarClienteTest.php:33

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] ReturnRemoval
Aplicacion/ListarCliente.php:19:13
         $clientesDominio = $this->repositorio->buscarTodos();
 
         return array_map(function (Cliente $cliente) {
-            return [
-                // Ajusta estos métodos según cómo se llamen los getters reales de tu entidad Cliente
-                'id_cliente' => method_exists($cliente, 'obtenerId') ? $cliente->obtenerId()->valor() : null, 
-                'nombre'     => $cliente->obtenerNombre(),
-                'email'      => $cliente->obtenerCorreoElectronico()->valor(),
-                'telefono'   => $cliente->obtenerTelefono()->valor(),
-                'rol'        => method_exists($cliente, 'obtenerRol') ? $cliente->obtenerRol() : 'cliente'
-            ];
+            
         }, $clientesDominio);
     }
killedBy: Tests\Cliente\Aplicacion\ListarClienteTest::test_debe_transformar_las_entidades_de_dominio_en_un_arreglo_plano_valido
statusReason: 1) Tests\Cliente\Aplicacion\ListarClienteTest::test_debe_transformar_las_entidades_de_dominio_en_un_arreglo_plano_valido
Failed asserting that null matches expected 5.

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Aplicacion\ListarClienteTest.php:66

FAILURES!
Tests: 2, Assertions: 6, Failures: 1, Warnings: 1.

[Killed] Ternary
Aplicacion/ListarCliente.php:21:17
         return array_map(function (Cliente $cliente) {
             return [
                 // Ajusta estos métodos según cómo se llamen los getters reales de tu entidad Cliente
-                'id_cliente' => method_exists($cliente, 'obtenerId') ? $cliente->obtenerId()->valor() : null, 
+                'id_cliente' => method_exists($cliente, 'obtenerId') ? null : $cliente->obtenerId()->valor(),
                 'nombre'     => $cliente->obtenerNombre(),
                 'email'      => $cliente->obtenerCorreoElectronico()->valor(),
killedBy: Tests\Cliente\Aplicacion\ListarClienteTest::test_debe_transformar_las_entidades_de_dominio_en_un_arreglo_plano_valido
statusReason: 1) Tests\Cliente\Aplicacion\ListarClienteTest::test_debe_transformar_las_entidades_de_dominio_en_un_arreglo_plano_valido
Failed asserting that null matches expected 5.

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Aplicacion\ListarClienteTest.php:66

FAILURES!
Tests: 2, Assertions: 6, Failures: 1.

[Killed] ArrayItem
Aplicacion/ListarCliente.php:22:17
             return [
                 // Ajusta estos métodos según cómo se llamen los getters reales de tu entidad Cliente
                 'id_cliente' => method_exists($cliente, 'obtenerId') ? $cliente->obtenerId()->valor() : null, 
-                'nombre'     => $cliente->obtenerNombre(),
+                'nombre' > $cliente->obtenerNombre(),
                 'email'      => $cliente->obtenerCorreoElectronico()->valor(),
                 'telefono'   => $cliente->obtenerTelefono()->valor(),
killedBy: Tests\Cliente\Aplicacion\ListarClienteTest::test_debe_transformar_las_entidades_de_dominio_en_un_arreglo_plano_valido
statusReason: 1) Tests\Cliente\Aplicacion\ListarClienteTest::test_debe_transformar_las_entidades_de_dominio_en_un_arreglo_plano_valido
Failed asserting that null matches expected 'Tony Stark'.

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Aplicacion\ListarClienteTest.php:67

FAILURES!
Tests: 2, Assertions: 7, Failures: 1, Warnings: 1.

[Killed] Ternary
Aplicacion/ListarCliente.php:25:17
                 'nombre'     => $cliente->obtenerNombre(),
                 'email'      => $cliente->obtenerCorreoElectronico()->valor(),
                 'telefono'   => $cliente->obtenerTelefono()->valor(),
-                'rol'        => method_exists($cliente, 'obtenerRol') ? $cliente->obtenerRol() : 'cliente'
+                'rol'        => method_exists($cliente, 'obtenerRol') ? 'cliente' : $cliente->obtenerRol()
             ];
         }, $clientesDominio);
killedBy: Tests\Cliente\Aplicacion\ListarClienteTest::test_debe_transformar_las_entidades_de_dominio_en_un_arreglo_plano_valido
statusReason: 1) Tests\Cliente\Aplicacion\ListarClienteTest::test_debe_transformar_las_entidades_de_dominio_en_un_arreglo_plano_valido
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'admin'
+'cliente'
