[Killed] PublicVisibility
Aplicacion/ModificarPerfilCliente.php:16:5
         private EnviadorNotificaciones $enviadorNotificaciones
     ) {}
 
-    public function ejecutar(ModificarPerfilClientePeticion $peticion): void {
+    protected function ejecutar(ModificarPerfilClientePeticion $peticion): void {
         $clienteId = new ClienteId($peticion->clienteId);
         $cliente = $this->repositorio->buscarPorId($clienteId);
killedBy: Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_lanzar_excepcion_si_usuario_no_existe
statusReason: 1) Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_lanzar_excepcion_si_usuario_no_existe
Failed asserting that exception of type "Error" matches expected exception "DomainException". Message was: "Call to protected method App\Cliente\Aplicacion\ModificarPerfilCliente::ejecutar() from scope Tests\Cliente\Aplicacion\ModificarPerfilClienteTest" at
C:\wamp64\www\Nueva carpeta\veterinari

[Killed] Throw_
Aplicacion/ModificarPerfilCliente.php:21:13
         $cliente = $this->repositorio->buscarPorId($clienteId);
 
         if ($cliente === null) {
-            throw new \DomainException("El propietario solicitado no existe en el sistema.");
+            new \DomainException("El propietario solicitado no existe en el sistema.");
         }
 
killedBy: Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_lanzar_excepcion_si_usuario_no_existe
statusReason: 1) Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_lanzar_excepcion_si_usuario_no_existe
Failed asserting that exception of type "Error" matches expected exception "DomainException". Message was: "Call to a member function obtenerCorreoElectronico() on null" at
C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Aplicacion\ModificarPerfilCliente.php:24
C:\wamp64\www\Nueva carpeta\ve

[Killed] Ternary
Aplicacion/ModificarPerfilCliente.php:27:9
         $correoOriginal = $cliente->obtenerCorreoElectronico();
         $telefonoOriginal = $cliente->obtenerTelefono();
 
-        $nombreFinal = $peticion->nuevoNombre !== null ? $peticion->nuevoNombre : $cliente->obtenerNombre();
+        $nombreFinal = $peticion->nuevoNombre !== null ? $cliente->obtenerNombre() : $peticion->nuevoNombre;
         $correoFinal = $peticion->nuevoCorreo !== null ? new CorreoElectronico($peticion->nuevoCorreo) : $correoOriginal;
         $telefonoFinal = $peticion->nuevoTelefono !== null ? new Telefono($peticion->nuevoTelefono) : $telefonoOriginal;
killedBy: Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_notificar_por_sms_si_cambia_el_correo_y_no_esta_duplicado
statusReason: 1) Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_notificar_por_sms_si_cambia_el_correo_y_no_esta_duplicado
TypeError: MockObject_RepositorioCliente_0679d6d5::actualizarDatosContacto(): Argument #2 ($nombre) must be of type string, null given, called in C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Aplicacion\ModificarPerfilCliente.php on line 40

C:\wamp64\www\Nueva carpeta\

[Killed] Ternary
Aplicacion/ModificarPerfilCliente.php:28:9
         $telefonoOriginal = $cliente->obtenerTelefono();
 
         $nombreFinal = $peticion->nuevoNombre !== null ? $peticion->nuevoNombre : $cliente->obtenerNombre();
-        $correoFinal = $peticion->nuevoCorreo !== null ? new CorreoElectronico($peticion->nuevoCorreo) : $correoOriginal;
+        $correoFinal = $peticion->nuevoCorreo !== null ? $correoOriginal : new CorreoElectronico($peticion->nuevoCorreo);
         $telefonoFinal = $peticion->nuevoTelefono !== null ? new Telefono($peticion->nuevoTelefono) : $telefonoOriginal;
 
killedBy: Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_notificar_por_sms_si_cambia_el_correo_y_no_esta_duplicado
statusReason: 1) Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_notificar_por_sms_si_cambia_el_correo_y_no_esta_duplicado
Expectation failed for method name is "enviarSmsAlerta" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 2, Assertions: 4, Failures: 1.

[Killed] Ternary
Aplicacion/ModificarPerfilCliente.php:29:9
 
         $nombreFinal = $peticion->nuevoNombre !== null ? $peticion->nuevoNombre : $cliente->obtenerNombre();
         $correoFinal = $peticion->nuevoCorreo !== null ? new CorreoElectronico($peticion->nuevoCorreo) : $correoOriginal;
-        $telefonoFinal = $peticion->nuevoTelefono !== null ? new Telefono($peticion->nuevoTelefono) : $telefonoOriginal;
+        $telefonoFinal = $peticion->nuevoTelefono !== null ? $telefonoOriginal : new Telefono($peticion->nuevoTelefono);
 
         // 🟢 SOLUCIÓN AL MUTANTE: Simplificamos el condicional redundante.
killedBy: Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_notificar_por_sms_si_cambia_el_correo_y_no_esta_duplicado
statusReason: 1) Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_notificar_por_sms_si_cambia_el_correo_y_no_esta_duplicado
TypeError: App\Cliente\Dominio\ObjetoValor\Telefono::__construct(): Argument #1 ($valor) must be of type string, null given, called in C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Aplicacion\ModificarPerfilCliente.php on line 29

C:\wamp64\www\Nueva carpeta\veterinaria

[Killed] NotIdentical
Aplicacion/ModificarPerfilCliente.php:34:9
         // 🟢 SOLUCIÓN AL MUTANTE: Simplificamos el condicional redundante.
         // Si el correo original y el final son diferentes, significa por defecto 
         // que el usuario sí envió un correo nuevo y que este cambió.
-        if ($correoOriginal->valor() !== $correoFinal->valor()) {
+        if ($correoOriginal->valor() === $correoFinal->valor()) {
             if ($this->repositorio->buscarPorCorreoElectronico($correoFinal) !== null) {
                 throw new \DomainException("El nuevo correo electrónico ya está registrado por otro propietario.");
killedBy: Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_fallar_si_el_nuevo_correo_ya_esta_duplicado_en_otro_usuario
statusReason: 1) Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_fallar_si_el_nuevo_correo_ya_esta_duplicado_en_otro_usuario
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Killed] NotIdentical
Aplicacion/ModificarPerfilCliente.php:35:13
         // Si el correo original y el final son diferentes, significa por defecto 
         // que el usuario sí envió un correo nuevo y que este cambió.
         if ($correoOriginal->valor() !== $correoFinal->valor()) {
-            if ($this->repositorio->buscarPorCorreoElectronico($correoFinal) !== null) {
+            if ($this->repositorio->buscarPorCorreoElectronico($correoFinal) === null) {
                 throw new \DomainException("El nuevo correo electrónico ya está registrado por otro propietario.");
             }
killedBy: Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_notificar_por_sms_si_cambia_el_correo_y_no_esta_duplicado
statusReason: 1) Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_notificar_por_sms_si_cambia_el_correo_y_no_esta_duplicado
DomainException: El nuevo correo electrónico ya está registrado por otro propietario.

C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Aplicacion\ModificarPerfilCliente.php:36
C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Aplicacion\ModificarPerfilClienteTest.php:

[Killed] Throw_
Aplicacion/ModificarPerfilCliente.php:36:17
         // que el usuario sí envió un correo nuevo y que este cambió.
         if ($correoOriginal->valor() !== $correoFinal->valor()) {
             if ($this->repositorio->buscarPorCorreoElectronico($correoFinal) !== null) {
-                throw new \DomainException("El nuevo correo electrónico ya está registrado por otro propietario.");
+                new \DomainException("El nuevo correo electrónico ya está registrado por otro propietario.");
             }
         }
killedBy: Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_fallar_si_el_nuevo_correo_ya_esta_duplicado_en_otro_usuario
statusReason: 1) Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_fallar_si_el_nuevo_correo_ya_esta_duplicado_en_otro_usuario
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 4, Assertions: 7, Failures: 1.

[Killed] MethodCallRemoval
Aplicacion/ModificarPerfilCliente.php:40:9
             }
         }
 
-        $this->repositorio->actualizarDatosContacto($clienteId, $nombreFinal, $correoFinal, $telefonoFinal);
+        
 
         if ($correoOriginal->valor() !== $correoFinal->valor()) {
killedBy: Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_notificar_por_sms_si_cambia_el_correo_y_no_esta_duplicado
statusReason: 1) Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_notificar_por_sms_si_cambia_el_correo_y_no_esta_duplicado
Expectation failed for method name is "actualizarDatosContacto" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.

[Killed] NotIdentical
Aplicacion/ModificarPerfilCliente.php:42:9
 
         $this->repositorio->actualizarDatosContacto($clienteId, $nombreFinal, $correoFinal, $telefonoFinal);
 
-        if ($correoOriginal->valor() !== $correoFinal->valor()) {
+        if ($correoOriginal->valor() === $correoFinal->valor()) {
             $this->enviadorNotificaciones->enviarSmsAlerta(
                 $telefonoOriginal,
killedBy: Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_notificar_por_sms_si_cambia_el_correo_y_no_esta_duplicado
statusReason: 1) Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_notificar_por_sms_si_cambia_el_correo_y_no_esta_duplicado
Expectation failed for method name is "enviarSmsAlerta" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 2, Assertions: 4, Failures: 1.

[Killed] MethodCallRemoval
Aplicacion/ModificarPerfilCliente.php:43:13
         $this->repositorio->actualizarDatosContacto($clienteId, $nombreFinal, $correoFinal, $telefonoFinal);
 
         if ($correoOriginal->valor() !== $correoFinal->valor()) {
-            $this->enviadorNotificaciones->enviarSmsAlerta(
-                $telefonoOriginal,
-                "Seguridad: El correo de tu cuenta veterinaria ha sido cambiado a: {$correoFinal->valor()}."
-            );
+            
         }
 
killedBy: Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_notificar_por_sms_si_cambia_el_correo_y_no_esta_duplicado
statusReason: 1) Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_notificar_por_sms_si_cambia_el_correo_y_no_esta_duplicado
Expectation failed for method name is "enviarSmsAlerta" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 2, Assertions: 4, Failures: 1.

[Killed] NotIdentical
Aplicacion/ModificarPerfilCliente.php:49:9
             );
         }
 
-        if ($telefonoOriginal->valor() !== $telefonoFinal->valor()) {
+        if ($telefonoOriginal->valor() === $telefonoFinal->valor()) {
             $this->enviadorNotificaciones->enviarEmailAlerta(
                 $correoOriginal,
killedBy: Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_notificar_por_email_si_cambia_el_telefono
statusReason: 1) Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_notificar_por_email_si_cambia_el_telefono
Expectation failed for method name is "enviarEmailAlerta" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.

[Killed] MethodCallRemoval
Aplicacion/ModificarPerfilCliente.php:50:13
         }
 
         if ($telefonoOriginal->valor() !== $telefonoFinal->valor()) {
-            $this->enviadorNotificaciones->enviarEmailAlerta(
-                $correoOriginal,
-                "Alerta: El teléfono de tu perfil ha sido modificado al: {$telefonoFinal->valor()}."
-            );
+            
         }
     }
killedBy: Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_notificar_por_email_si_cambia_el_telefono
statusReason: 1) Tests\Cliente\Aplicacion\ModificarPerfilClienteTest::test_debe_notificar_por_email_si_cambia_el_telefono
Expectation failed for method name is "enviarEmailAlerta" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 3, Assertions: 6, Failures: 1.
