[Killed] PublicVisibility
Aplicacion/RegistrarCliente.php:16:5
         private CifradorContrasena $cifrador
     ) {}
 
-    public function ejecutar(RegistrarClientePeticion $peticion): void {
+    protected function ejecutar(RegistrarClientePeticion $peticion): void {
         $correo = new CorreoElectronico($peticion->correoElectronico);
         $telefono = new Telefono($peticion->telefono);
killedBy: Tests\Cliente\Aplicacion\RegistrarClienteTest::test_debe_registrar_cliente_exitosamente
statusReason: 1) Tests\Cliente\Aplicacion\RegistrarClienteTest::test_debe_registrar_cliente_exitosamente
Error: Call to protected method App\Cliente\Aplicacion\RegistrarCliente::ejecutar() from scope Tests\Cliente\Aplicacion\RegistrarClienteTest

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Aplicacion\RegistrarClienteTest.php:51

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] NotIdentical
Aplicacion/RegistrarCliente.php:20:9
         $correo = new CorreoElectronico($peticion->correoElectronico);
         $telefono = new Telefono($peticion->telefono);
 
-        if ($this->repositorio->buscarPorCorreoElectronico($correo) !== null) {
+        if ($this->repositorio->buscarPorCorreoElectronico($correo) === null) {
             throw new \DomainException("El correo electrónico ya se encuentra registrado.");
         }
killedBy: Tests\Cliente\Aplicacion\RegistrarClienteTest::test_debe_registrar_cliente_exitosamente
statusReason: 1) Tests\Cliente\Aplicacion\RegistrarClienteTest::test_debe_registrar_cliente_exitosamente
DomainException: El correo electrónico ya se encuentra registrado.

C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Aplicacion\RegistrarCliente.php:21
C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Aplicacion\RegistrarClienteTest.php:51

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] Throw_
Aplicacion/RegistrarCliente.php:21:13
         $telefono = new Telefono($peticion->telefono);
 
         if ($this->repositorio->buscarPorCorreoElectronico($correo) !== null) {
-            throw new \DomainException("El correo electrónico ya se encuentra registrado.");
+            new \DomainException("El correo electrónico ya se encuentra registrado.");
         }
 
killedBy: Tests\Cliente\Aplicacion\RegistrarClienteTest::test_debe_fallar_si_el_correo_ya_existe
statusReason: 1) Tests\Cliente\Aplicacion\RegistrarClienteTest::test_debe_fallar_si_el_correo_ya_existe
C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Aplicacion\RegistrarCliente.php:24
C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Aplicacion\RegistrarClienteTest.php:73
.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] MethodCallRemoval
Aplicacion/RegistrarCliente.php:27:9
         $contrasenaCifrada = $this->cifrador->cifrar($peticion->contrasenaPlana);
         $cliente = new Cliente($peticion->nombre, $correo, $telefono, $contrasenaCifrada);
 
-        $this->repositorio->guardar($cliente);
+        
     }
 }
killedBy: Tests\Cliente\Aplicacion\RegistrarClienteTest::test_debe_registrar_cliente_exitosamente
statusReason: 1) Tests\Cliente\Aplicacion\RegistrarClienteTest::test_debe_registrar_cliente_exitosamente
Expectation failed for method name is "guardar" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
