[Killed] PublicVisibility
Aplicacion/SolicitarRecuperacionContrasena.php:14:5
         private EnviadorNotificaciones $enviadorNotificaciones
     ) {}
 
-    public function ejecutar(RecuperarContrasenaPeticion $peticion): void {
+    protected function ejecutar(RecuperarContrasenaPeticion $peticion): void {
         $correo = new CorreoElectronico($peticion->correoElectronico);
         $cliente = $this->repositorio->buscarPorCorreoElectronico($correo);
killedBy: Tests\Cliente\Aplicacion\SolicitarRecuperacionContrasenaTest::test_debe_enviar_correo_si_el_usuario_existe
statusReason: 1) Tests\Cliente\Aplicacion\SolicitarRecuperacionContrasenaTest::test_debe_enviar_correo_si_el_usuario_existe
Error: Call to protected method App\Cliente\Aplicacion\SolicitarRecuperacionContrasena::ejecutar() from scope Tests\Cliente\Aplicacion\SolicitarRecuperacionContrasenaTest

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Aplicacion\SolicitarRecuperacionContrasenaTest.php:54

ERRORS!
T

[Killed] ReturnRemoval
Aplicacion/SolicitarRecuperacionContrasena.php:19:13
         $cliente = $this->repositorio->buscarPorCorreoElectronico($correo);
 
         if ($cliente === null) {
-            return; 
+            
         }
 
killedBy: Tests\Cliente\Aplicacion\SolicitarRecuperacionContrasenaTest::test_debe_terminar_silenciosamente_si_el_usuario_no_existe
statusReason: 1) Tests\Cliente\Aplicacion\SolicitarRecuperacionContrasenaTest::test_debe_terminar_silenciosamente_si_el_usuario_no_existe
App\Cliente\Aplicacion\EnviadorNotificaciones::enviarCorreoRestablecimiento(App\Cliente\Dominio\ObjetoValor\CorreoElectronico Object (...), 'https://veterinaria.com/resta...uro123'): void was not expected to be called.

C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Apli

[Killed] MethodCallRemoval
Aplicacion/SolicitarRecuperacionContrasena.php:23:9
         }
 
         $enlaceRecuperacion = "https://veterinaria.com/restablecer-clave?token=tokenSeguro123";
-        $this->enviadorNotificaciones->enviarCorreoRestablecimiento($correo, $enlaceRecuperacion);
+        
     }
 }
killedBy: Tests\Cliente\Aplicacion\SolicitarRecuperacionContrasenaTest::test_debe_enviar_correo_si_el_usuario_existe
statusReason: 1) Tests\Cliente\Aplicacion\SolicitarRecuperacionContrasenaTest::test_debe_enviar_correo_si_el_usuario_existe
Expectation failed for method name is "enviarCorreoRestablecimiento" when invoked 1 time.
Method was expected to be called 1 time, actually called 0 times.

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
