[Killed] UnwrapTrim
Dominio/Cliente.php:26:9
         string $rol = 'cliente',
         ?ClienteId $id = null
     ) {
-        if (empty(trim($nombre))) {
+        if (empty($nombre)) {
             throw new \DomainException("El nombre del cliente no puede estar vacío.");
         }
killedBy: Tests\Cliente\Dominio\ClienteTest::test_no_debe_permitir_un_nombre_vacio
statusReason: 1) Tests\Cliente\Dominio\ClienteTest::test_no_debe_permitir_un_nombre_vacio
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 3, Assertions: 8, Failures: 1.

[Killed] Throw_
Dominio/Cliente.php:27:13
         ?ClienteId $id = null
     ) {
         if (empty(trim($nombre))) {
-            throw new \DomainException("El nombre del cliente no puede estar vacío.");
+            new \DomainException("El nombre del cliente no puede estar vacío.");
         }
         
killedBy: Tests\Cliente\Dominio\ClienteTest::test_no_debe_permitir_un_nombre_vacio
statusReason: 1) Tests\Cliente\Dominio\ClienteTest::test_no_debe_permitir_un_nombre_vacio
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 3, Assertions: 8, Failures: 1.

[Killed] MethodCallRemoval
Dominio/Cliente.php:35:9
         $this->telefono = $telefono;
         $this->contrasena = $contrasena;
         $this->id = $id;
-        $this->establecerRol($rol);
+        
     }
 
killedBy: Tests\Cliente\Dominio\ClienteTest::test_debe_crear_un_cliente_con_valores_correctos_y_rol_por_defecto
statusReason: 1) Tests\Cliente\Dominio\ClienteTest::test_debe_crear_un_cliente_con_valores_correctos_y_rol_por_defecto
Error: Typed property App\Cliente\Dominio\Cliente::$rol must not be accessed before initialization

C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Dominio\Cliente.php:61
C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ClienteTest.php:45

ERRORS!
Tests: 1, Assertions: 4, Error

[Killed] PublicVisibility
Dominio/Cliente.php:39:5
     }
 
     // 🎯 Mutaciones de estado y Reglas de Negocio
-    public function promoverAVeterinario(): void {
+    protected function promoverAVeterinario(): void {
         $this->rol = 'veterinario';
     }
killedBy: Tests\Cliente\Dominio\ClienteTest::test_debe_promover_a_veterinario_correctamente
statusReason: 1) Tests\Cliente\Dominio\ClienteTest::test_debe_promover_a_veterinario_correctamente
Error: Call to protected method App\Cliente\Dominio\Cliente::promoverAVeterinario() from scope Tests\Cliente\Dominio\ClienteTest

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ClienteTest.php:107

ERRORS!
Tests: 6, Assertions: 12, Errors: 1.

[Killed] PublicVisibility
Dominio/Cliente.php:43:5
         $this->rol = 'veterinario';
     }
 
-    public function promoverAAdministrador(): void {
+    protected function promoverAAdministrador(): void {
         $this->rol = 'admin';
     }
killedBy: Tests\Cliente\Dominio\ClienteTest::test_debe_promover_a_administrador_correctamente
statusReason: 1) Tests\Cliente\Dominio\ClienteTest::test_debe_promover_a_administrador_correctamente
Error: Call to protected method App\Cliente\Dominio\Cliente::promoverAAdministrador() from scope Tests\Cliente\Dominio\ClienteTest

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ClienteTest.php:98

ERRORS!
Tests: 5, Assertions: 11, Errors: 1.

[Killed] ArrayItemRemoval
Dominio/Cliente.php:48:9
     }
 
     private function establecerRol(string $rol): void {
-        $rolesPermitidos = ['cliente', 'admin', 'veterinario'];
+        $rolesPermitidos = ['admin', 'veterinario'];
         if (!in_array($rol, $rolesPermitidos)) {
             throw new \DomainException("El rol '{$rol}' no está permitido en la veterinaria.");
killedBy: Tests\Cliente\Dominio\ClienteTest::test_debe_crear_un_cliente_con_valores_correctos_y_rol_por_defecto
statusReason: 1) Tests\Cliente\Dominio\ClienteTest::test_debe_crear_un_cliente_con_valores_correctos_y_rol_por_defecto
DomainException: El rol 'cliente' no está permitido en la veterinaria.

C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Dominio\Cliente.php:50
C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Dominio\Cliente.php:35
C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ClienteTest

[Killed] LogicalNot
Dominio/Cliente.php:49:9
 
     private function establecerRol(string $rol): void {
         $rolesPermitidos = ['cliente', 'admin', 'veterinario'];
-        if (!in_array($rol, $rolesPermitidos)) {
+        if (in_array($rol, $rolesPermitidos)) {
             throw new \DomainException("El rol '{$rol}' no está permitido en la veterinaria.");
         }
killedBy: Tests\Cliente\Dominio\ClienteTest::test_debe_crear_un_cliente_con_valores_correctos_y_rol_por_defecto
statusReason: 1) Tests\Cliente\Dominio\ClienteTest::test_debe_crear_un_cliente_con_valores_correctos_y_rol_por_defecto
DomainException: El rol 'cliente' no está permitido en la veterinaria.

C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Dominio\Cliente.php:50
C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Dominio\Cliente.php:35
C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ClienteTest

[Killed] Throw_
Dominio/Cliente.php:50:13
     private function establecerRol(string $rol): void {
         $rolesPermitidos = ['cliente', 'admin', 'veterinario'];
         if (!in_array($rol, $rolesPermitidos)) {
-            throw new \DomainException("El rol '{$rol}' no está permitido en la veterinaria.");
+            new \DomainException("El rol '{$rol}' no está permitido en la veterinaria.");
         }
         $this->rol = $rol;
killedBy: Tests\Cliente\Dominio\ClienteTest::test_no_debe_permitir_un_rol_invalido
statusReason: 1) Tests\Cliente\Dominio\ClienteTest::test_no_debe_permitir_un_rol_invalido
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 4, Assertions: 10, Failures: 1.

[Killed] PublicVisibility
Dominio/Cliente.php:56:5
     }
 
     // Getters estrictamente tipados en castellano
-    public function obtenerId(): ?ClienteId { return $this->id; }
+    protected function obtenerId(): ?ClienteId { return $this->id; }
     public function obtenerNombre(): string { return $this->nombre; }
     public function obtenerCorreoElectronico(): CorreoElectronico { return $this->correoElectronico; }
killedBy: Tests\Cliente\Dominio\ClienteTest::test_debe_crear_un_cliente_con_valores_correctos_y_rol_por_defecto
statusReason: 1) Tests\Cliente\Dominio\ClienteTest::test_debe_crear_un_cliente_con_valores_correctos_y_rol_por_defecto
Error: Call to protected method App\Cliente\Dominio\Cliente::obtenerId() from scope Tests\Cliente\Dominio\ClienteTest

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ClienteTest.php:46

ERRORS!
Tests: 1, Assertions: 5, Errors: 1.

[Killed] PublicVisibility
Dominio/Cliente.php:57:5
 
     // Getters estrictamente tipados en castellano
     public function obtenerId(): ?ClienteId { return $this->id; }
-    public function obtenerNombre(): string { return $this->nombre; }
+    protected function obtenerNombre(): string { return $this->nombre; }
     public function obtenerCorreoElectronico(): CorreoElectronico { return $this->correoElectronico; }
     public function obtenerTelefono(): Telefono { return $this->telefono; }
killedBy: Tests\Cliente\Dominio\ClienteTest::test_debe_crear_un_cliente_con_valores_correctos_y_rol_por_defecto
statusReason: 1) Tests\Cliente\Dominio\ClienteTest::test_debe_crear_un_cliente_con_valores_correctos_y_rol_por_defecto
Error: Call to protected method App\Cliente\Dominio\Cliente::obtenerNombre() from scope Tests\Cliente\Dominio\ClienteTest

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ClienteTest.php:41

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Dominio/Cliente.php:58:5
     // Getters estrictamente tipados en castellano
     public function obtenerId(): ?ClienteId { return $this->id; }
     public function obtenerNombre(): string { return $this->nombre; }
-    public function obtenerCorreoElectronico(): CorreoElectronico { return $this->correoElectronico; }
+    protected function obtenerCorreoElectronico(): CorreoElectronico { return $this->correoElectronico; }
     public function obtenerTelefono(): Telefono { return $this->telefono; }
     public function obtenerContrasena(): Contrasena { return $this->contrasena; }
killedBy: Tests\Cliente\Dominio\ClienteTest::test_debe_crear_un_cliente_con_valores_correctos_y_rol_por_defecto
statusReason: 1) Tests\Cliente\Dominio\ClienteTest::test_debe_crear_un_cliente_con_valores_correctos_y_rol_por_defecto
Error: Call to protected method App\Cliente\Dominio\Cliente::obtenerCorreoElectronico() from scope Tests\Cliente\Dominio\ClienteTest

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ClienteTest.php:42

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.

[Killed] PublicVisibility
Dominio/Cliente.php:59:5
     public function obtenerId(): ?ClienteId { return $this->id; }
     public function obtenerNombre(): string { return $this->nombre; }
     public function obtenerCorreoElectronico(): CorreoElectronico { return $this->correoElectronico; }
-    public function obtenerTelefono(): Telefono { return $this->telefono; }
+    protected function obtenerTelefono(): Telefono { return $this->telefono; }
     public function obtenerContrasena(): Contrasena { return $this->contrasena; }
     public function obtenerRol(): string { return $this->rol; }
killedBy: Tests\Cliente\Dominio\ClienteTest::test_debe_crear_un_cliente_con_valores_correctos_y_rol_por_defecto
statusReason: 1) Tests\Cliente\Dominio\ClienteTest::test_debe_crear_un_cliente_con_valores_correctos_y_rol_por_defecto
Error: Call to protected method App\Cliente\Dominio\Cliente::obtenerTelefono() from scope Tests\Cliente\Dominio\ClienteTest

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ClienteTest.php:43

ERRORS!
Tests: 1, Assertions: 2, Errors: 1.

[Killed] PublicVisibility
Dominio/Cliente.php:60:5
     public function obtenerNombre(): string { return $this->nombre; }
     public function obtenerCorreoElectronico(): CorreoElectronico { return $this->correoElectronico; }
     public function obtenerTelefono(): Telefono { return $this->telefono; }
-    public function obtenerContrasena(): Contrasena { return $this->contrasena; }
+    protected function obtenerContrasena(): Contrasena { return $this->contrasena; }
     public function obtenerRol(): string { return $this->rol; }
 
killedBy: Tests\Cliente\Dominio\ClienteTest::test_debe_crear_un_cliente_con_valores_correctos_y_rol_por_defecto
statusReason: 1) Tests\Cliente\Dominio\ClienteTest::test_debe_crear_un_cliente_con_valores_correctos_y_rol_por_defecto
Error: Call to protected method App\Cliente\Dominio\Cliente::obtenerContrasena() from scope Tests\Cliente\Dominio\ClienteTest

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ClienteTest.php:44

ERRORS!
Tests: 1, Assertions: 3, Errors: 1.

[Killed] PublicVisibility
Dominio/Cliente.php:61:5
     public function obtenerCorreoElectronico(): CorreoElectronico { return $this->correoElectronico; }
     public function obtenerTelefono(): Telefono { return $this->telefono; }
     public function obtenerContrasena(): Contrasena { return $this->contrasena; }
-    public function obtenerRol(): string { return $this->rol; }
+    protected function obtenerRol(): string { return $this->rol; }
 
     public function mapearAArreglo(): array {
killedBy: Tests\Cliente\Dominio\ClienteTest::test_debe_crear_un_cliente_con_valores_correctos_y_rol_por_defecto
statusReason: 1) Tests\Cliente\Dominio\ClienteTest::test_debe_crear_un_cliente_con_valores_correctos_y_rol_por_defecto
Error: Call to protected method App\Cliente\Dominio\Cliente::obtenerRol() from scope Tests\Cliente\Dominio\ClienteTest

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ClienteTest.php:45

ERRORS!
Tests: 1, Assertions: 4, Errors: 1.

[Killed] PublicVisibility
Dominio/Cliente.php:63:5
     public function obtenerContrasena(): Contrasena { return $this->contrasena; }
     public function obtenerRol(): string { return $this->rol; }
 
-    public function mapearAArreglo(): array {
+    protected function mapearAArreglo(): array {
         return [
             'id' => $this->id ? $this->id->valor() : null,
killedBy: Tests\Cliente\Dominio\ClienteTest::test_debe_mapear_el_cliente_a_un_arreglo_plano_correctamente
statusReason: 1) Tests\Cliente\Dominio\ClienteTest::test_debe_mapear_el_cliente_a_un_arreglo_plano_correctamente
Error: Call to protected method App\Cliente\Dominio\Cliente::mapearAArreglo() from scope Tests\Cliente\Dominio\ClienteTest

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ClienteTest.php:125

ERRORS!
Tests: 7, Assertions: 13, Errors: 1.

[Killed] Ternary
Dominio/Cliente.php:65:13
 
     public function mapearAArreglo(): array {
         return [
-            'id' => $this->id ? $this->id->valor() : null,
+            'id' => $this->id ? null : $this->id->valor(),
             'nombre' => $this->nombre,
             'correo_electronico' => $this->correoElectronico->valor(),
killedBy: Tests\Cliente\Dominio\ClienteTest::test_debe_mapear_el_cliente_a_un_arreglo_plano_correctamente
statusReason: 1) Tests\Cliente\Dominio\ClienteTest::test_debe_mapear_el_cliente_a_un_arreglo_plano_correctamente
Failed asserting that null matches expected 100.

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ClienteTest.php:127

FAILURES!
Tests: 7, Assertions: 14, Failures: 1.

[Killed] ArrayItem
Dominio/Cliente.php:66:13
     public function mapearAArreglo(): array {
         return [
             'id' => $this->id ? $this->id->valor() : null,
-            'nombre' => $this->nombre,
+            'nombre' > $this->nombre,
             'correo_electronico' => $this->correoElectronico->valor(),
             'telefono' => $this->telefono->valor(),
killedBy: Tests\Cliente\Dominio\ClienteTest::test_debe_mapear_el_cliente_a_un_arreglo_plano_correctamente
statusReason: 1) Tests\Cliente\Dominio\ClienteTest::test_debe_mapear_el_cliente_a_un_arreglo_plano_correctamente
Failed asserting that null matches expected 'Carlos Mendoza'.

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ClienteTest.php:128

FAILURES!
Tests: 7, Assertions: 15, Failures: 1, Warnings: 1.

[Killed] ArrayItem
Dominio/Cliente.php:67:13
         return [
             'id' => $this->id ? $this->id->valor() : null,
             'nombre' => $this->nombre,
-            'correo_electronico' => $this->correoElectronico->valor(),
+            'correo_electronico' > $this->correoElectronico->valor(),
             'telefono' => $this->telefono->valor(),
             'rol' => $this->rol
killedBy: Tests\Cliente\Dominio\ClienteTest::test_debe_mapear_el_cliente_a_un_arreglo_plano_correctamente
statusReason: 1) Tests\Cliente\Dominio\ClienteTest::test_debe_mapear_el_cliente_a_un_arreglo_plano_correctamente
Failed asserting that null matches expected 'carlos@correo.com'.

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ClienteTest.php:129

FAILURES!
Tests: 7, Assertions: 16, Failures: 1, Warnings: 1.
