[Killed] LessThanOrEqualToNegotiation
Dominio/ObjetoValor/ClienteId.php:7:9
 
 final class ClienteId {
     public function __construct(private int $valor) {
-        if ($valor <= 0) {
+        if ($valor > 0) {
             throw new \InvalidArgumentException("El ID del cliente debe ser un número entero positivo.");
         }
killedBy: Tests\Cliente\Dominio\ObjetoValor\ClienteIdTest::test_debe_crear_id_valido
statusReason: 1) Tests\Cliente\Dominio\ObjetoValor\ClienteIdTest::test_debe_crear_id_valido
InvalidArgumentException: El ID del cliente debe ser un número entero positivo.

C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Dominio\ObjetoValor\ClienteId.php:8
C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ObjetoValor\ClienteIdTest.php:12

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] LessThanOrEqualTo
Dominio/ObjetoValor/ClienteId.php:7:9
 
 final class ClienteId {
     public function __construct(private int $valor) {
-        if ($valor <= 0) {
+        if ($valor < 0) {
             throw new \InvalidArgumentException("El ID del cliente debe ser un número entero positivo.");
         }
killedBy: Tests\Cliente\Dominio\ObjetoValor\ClienteIdTest::test_debe_lanzar_excepcion_si_el_id_es_cero
statusReason: 1) Tests\Cliente\Dominio\ObjetoValor\ClienteIdTest::test_debe_lanzar_excepcion_si_el_id_es_cero
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] Throw_
Dominio/ObjetoValor/ClienteId.php:8:13
 final class ClienteId {
     public function __construct(private int $valor) {
         if ($valor <= 0) {
-            throw new \InvalidArgumentException("El ID del cliente debe ser un número entero positivo.");
+            new \InvalidArgumentException("El ID del cliente debe ser un número entero positivo.");
         }
     }
killedBy: Tests\Cliente\Dominio\ObjetoValor\ClienteIdTest::test_debe_lanzar_excepcion_si_el_id_es_cero
statusReason: 1) Tests\Cliente\Dominio\ObjetoValor\ClienteIdTest::test_debe_lanzar_excepcion_si_el_id_es_cero
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Dominio/ObjetoValor/ClienteId.php:12:5
         }
     }
 
-    public function valor(): int { 
+    protected function valor(): int {
         return $this->valor; 
     }
killedBy: Tests\Cliente\Dominio\ObjetoValor\ClienteIdTest::test_debe_crear_id_valido
statusReason: 1) Tests\Cliente\Dominio\ObjetoValor\ClienteIdTest::test_debe_crear_id_valido
Error: Call to protected method App\Cliente\Dominio\ObjetoValor\ClienteId::valor() from scope Tests\Cliente\Dominio\ObjetoValor\ClienteIdTest

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ObjetoValor\ClienteIdTest.php:13

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
