[Killed] UnwrapTrim
Dominio/ObjetoValor/Contrasena.php:7:9
 
 final class Contrasena {
     public function __construct(private string $valor) {
-        if (empty(trim($valor))) {
+        if (empty($valor)) {
             throw new \DomainException("La contraseña no puede estar vacía.");
         }
killedBy: Tests\Cliente\Dominio\ObjetoValor\ContrasenaTest::test_debe_fallar_si_el_hash_de_la_contrasena_esta_vacio
statusReason: 1) Tests\Cliente\Dominio\ObjetoValor\ContrasenaTest::test_debe_fallar_si_el_hash_de_la_contrasena_esta_vacio
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 2, Assertions: 4, Failures: 1.

[Killed] Throw_
Dominio/ObjetoValor/Contrasena.php:8:13
 final class Contrasena {
     public function __construct(private string $valor) {
         if (empty(trim($valor))) {
-            throw new \DomainException("La contraseña no puede estar vacía.");
+            new \DomainException("La contraseña no puede estar vacía.");
         }
     }
killedBy: Tests\Cliente\Dominio\ObjetoValor\ContrasenaTest::test_debe_fallar_si_el_hash_de_la_contrasena_esta_vacio
statusReason: 1) Tests\Cliente\Dominio\ObjetoValor\ContrasenaTest::test_debe_fallar_si_el_hash_de_la_contrasena_esta_vacio
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 2, Assertions: 4, Failures: 1.

[Killed] PublicVisibility
Dominio/ObjetoValor/Contrasena.php:12:5
         }
     }
 
-    public function valor(): string { 
+    protected function valor(): string {
         return $this->valor; 
     }
killedBy: Tests\Cliente\Dominio\ObjetoValor\ContrasenaTest::test_debe_crear_contrasena_valida_y_permitir_verificarla
statusReason: 1) Tests\Cliente\Dominio\ObjetoValor\ContrasenaTest::test_debe_crear_contrasena_valida_y_permitir_verificarla
Error: Call to protected method App\Cliente\Dominio\ObjetoValor\Contrasena::valor() from scope Tests\Cliente\Dominio\ObjetoValor\ContrasenaTest

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ObjetoValor\ContrasenaTest.php:17

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] PublicVisibility
Dominio/ObjetoValor/Contrasena.php:16:5
         return $this->valor; 
     }
     
-    public function verificar(string $contrasenaPlana): bool {
+    protected function verificar(string $contrasenaPlana): bool {
         return password_verify($contrasenaPlana, $this->valor);
     }
killedBy: Tests\Cliente\Dominio\ObjetoValor\ContrasenaTest::test_debe_crear_contrasena_valida_y_permitir_verificarla
statusReason: 1) Tests\Cliente\Dominio\ObjetoValor\ContrasenaTest::test_debe_crear_contrasena_valida_y_permitir_verificarla
Error: Call to protected method App\Cliente\Dominio\ObjetoValor\Contrasena::verificar() from scope Tests\Cliente\Dominio\ObjetoValor\ContrasenaTest

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ObjetoValor\ContrasenaTest.php:18

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.
