[Killed] UnwrapTrim
Dominio/ObjetoValor/CorreoElectronico.php:10:9
 
     public function __construct(string $valor) {
         // 💡 Primero limpiamos los espacios y normalizamos a minúsculas
-        $valorLimpio = strtolower(trim($valor));
+        $valorLimpio = strtolower($valor);
 
         // 💡 Ahora validamos el string ya procesado
killedBy: Tests\Cliente\Dominio\ObjetoValor\CorreoElectronicoTest::test_debe_crear_correo_valido_y_normalizarlo
statusReason: 1) Tests\Cliente\Dominio\ObjetoValor\CorreoElectronicoTest::test_debe_crear_correo_valido_y_normalizarlo
DomainException: El formato del correo electrónico no es válido.

C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Dominio\ObjetoValor\CorreoElectronico.php:14
C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ObjetoValor\CorreoElectronicoTest.php:12

ERRORS!
Tests: 1, Assertions

[Killed] UnwrapStrToLower
Dominio/ObjetoValor/CorreoElectronico.php:10:9
 
     public function __construct(string $valor) {
         // 💡 Primero limpiamos los espacios y normalizamos a minúsculas
-        $valorLimpio = strtolower(trim($valor));
+        $valorLimpio = trim($valor);
 
         // 💡 Ahora validamos el string ya procesado
killedBy: Tests\Cliente\Dominio\ObjetoValor\CorreoElectronicoTest::test_debe_crear_correo_valido_y_normalizarlo
statusReason: 1) Tests\Cliente\Dominio\ObjetoValor\CorreoElectronicoTest::test_debe_crear_correo_valido_y_normalizarlo
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'vet@ejemplo.com'
+'VET@ejemplo.com'

[Killed] LogicalNot
Dominio/ObjetoValor/CorreoElectronico.php:13:9
         $valorLimpio = strtolower(trim($valor));
 
         // 💡 Ahora validamos el string ya procesado
-        if (!filter_var($valorLimpio, FILTER_VALIDATE_EMAIL)) {
+        if (filter_var($valorLimpio, FILTER_VALIDATE_EMAIL)) {
             throw new \DomainException("El formato del correo electrónico no es válido.");
         }
killedBy: Tests\Cliente\Dominio\ObjetoValor\CorreoElectronicoTest::test_debe_crear_correo_valido_y_normalizarlo
statusReason: 1) Tests\Cliente\Dominio\ObjetoValor\CorreoElectronicoTest::test_debe_crear_correo_valido_y_normalizarlo
DomainException: El formato del correo electrónico no es válido.

C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Dominio\ObjetoValor\CorreoElectronico.php:14
C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ObjetoValor\CorreoElectronicoTest.php:12

ERRORS!
Tests: 1, Assertions

[Killed] Throw_
Dominio/ObjetoValor/CorreoElectronico.php:14:13
 
         // 💡 Ahora validamos el string ya procesado
         if (!filter_var($valorLimpio, FILTER_VALIDATE_EMAIL)) {
-            throw new \DomainException("El formato del correo electrónico no es válido.");
+            new \DomainException("El formato del correo electrónico no es válido.");
         }
         
killedBy: Tests\Cliente\Dominio\ObjetoValor\CorreoElectronicoTest::test_debe_lanzar_excepcion_si_el_formato_es_invalido
statusReason: 1) Tests\Cliente\Dominio\ObjetoValor\CorreoElectronicoTest::test_debe_lanzar_excepcion_si_el_formato_es_invalido
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.
