[Killed] UnwrapTrim
Dominio/ObjetoValor/Telefono.php:13:9
 
     public function __construct(string $valor) {
         // Removemos espacios en blanco accidentales que envíe el usuario
-        $valorLimpio = trim($valor);
+        $valorLimpio = $valor;
 
         // ^9       -> Obliga a empezar con el dígito 9 (Prefijo celular local)
killedBy: Tests\Cliente\Dominio\ObjetoValor\TelefonoTest::testDeberiaLimpiarEspaciosEnBlancoAccidentales
statusReason: 1) Tests\Cliente\Dominio\ObjetoValor\TelefonoTest::testDeberiaLimpiarEspaciosEnBlancoAccidentales
DomainException: El teléfono debe ser un número celular local válido (9 dígitos y empezar con 9).

C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Dominio\ObjetoValor\Telefono.php:18
C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ObjetoValor\TelefonoTest.php:55

ERRORS!
Tests: 7, As

[Killed] LogicalNot
Dominio/ObjetoValor/Telefono.php:17:9
 
         // ^9       -> Obliga a empezar con el dígito 9 (Prefijo celular local)
         // [0-9]{8}$ -> Obliga a que le sigan exactamente 8 números más (Total = 9 dígitos)
-        if (!preg_match('/^^9[0-9]{8}$/', $valorLimpio)) {
+        if (preg_match('/^^9[0-9]{8}$/', $valorLimpio)) {
             throw new \DomainException("El teléfono debe ser un número celular local válido (9 dígitos y empezar con 9).");
         }
killedBy: Tests\Cliente\Dominio\ObjetoValor\TelefonoTest::test_debe_crear_telefono_valido
statusReason: 1) Tests\Cliente\Dominio\ObjetoValor\TelefonoTest::test_debe_crear_telefono_valido
DomainException: El teléfono debe ser un número celular local válido (9 dígitos y empezar con 9).

C:\wamp64\www\Nueva carpeta\veterinaria\src\Cliente\Dominio\ObjetoValor\Telefono.php:18
C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ObjetoValor\TelefonoTest.php:13

ERRORS!
Tests: 1, Assertions: 0, Er

[Killed] PregMatchRemoveDollar
Dominio/ObjetoValor/Telefono.php:17:9
 
         // ^9       -> Obliga a empezar con el dígito 9 (Prefijo celular local)
         // [0-9]{8}$ -> Obliga a que le sigan exactamente 8 números más (Total = 9 dígitos)
-        if (!preg_match('/^^9[0-9]{8}$/', $valorLimpio)) {
+        if (!preg_match('/^^9[0-9]{8}/', $valorLimpio)) {
             throw new \DomainException("El teléfono debe ser un número celular local válido (9 dígitos y empezar con 9).");
         }
killedBy: Tests\Cliente\Dominio\ObjetoValor\TelefonoTest::test_debe_fallar_si_no_tiene_nueve_digitos
statusReason: 1) Tests\Cliente\Dominio\ObjetoValor\TelefonoTest::test_debe_fallar_si_no_tiene_nueve_digitos
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.

[Killed] Throw_
Dominio/ObjetoValor/Telefono.php:18:13
         // ^9       -> Obliga a empezar con el dígito 9 (Prefijo celular local)
         // [0-9]{8}$ -> Obliga a que le sigan exactamente 8 números más (Total = 9 dígitos)
         if (!preg_match('/^^9[0-9]{8}$/', $valorLimpio)) {
-            throw new \DomainException("El teléfono debe ser un número celular local válido (9 dígitos y empezar con 9).");
+            new \DomainException("El teléfono debe ser un número celular local válido (9 dígitos y empezar con 9).");
         }
 
killedBy: Tests\Cliente\Dominio\ObjetoValor\TelefonoTest::test_debe_fallar_si_tiene_letras
statusReason: 1) Tests\Cliente\Dominio\ObjetoValor\TelefonoTest::test_debe_fallar_si_tiene_letras
Failed asserting that exception of type "DomainException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Dominio/ObjetoValor/Telefono.php:31:5
     /**
      * Comparación semántica de objetos de valor.
      */
-    public function esIgualA(Telefono $otro): bool {
+    protected function esIgualA(Telefono $otro): bool {
         return $this->valor === $otro->valor();
     }
killedBy: Tests\Cliente\Dominio\ObjetoValor\TelefonoTest::test_debe_retornar_true_si_los_telefonos_tienen_el_mismo_numero
statusReason: 1) Tests\Cliente\Dominio\ObjetoValor\TelefonoTest::test_debe_retornar_true_si_los_telefonos_tienen_el_mismo_numero
Error: Call to protected method App\Cliente\Dominio\ObjetoValor\Telefono::esIgualA() from scope Tests\Cliente\Dominio\ObjetoValor\TelefonoTest

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ObjetoValor\TelefonoTest.php:41

ERRORS!
Tests: 5, Assertions: 7, Errors: 1.

[Killed] Identical
Dominio/ObjetoValor/Telefono.php:32:9
      * Comparación semántica de objetos de valor.
      */
     public function esIgualA(Telefono $otro): bool {
-        return $this->valor === $otro->valor();
+        return $this->valor !== $otro->valor();
     }
 }
killedBy: Tests\Cliente\Dominio\ObjetoValor\TelefonoTest::test_debe_retornar_true_si_los_telefonos_tienen_el_mismo_numero
statusReason: 1) Tests\Cliente\Dominio\ObjetoValor\TelefonoTest::test_debe_retornar_true_si_los_telefonos_tienen_el_mismo_numero
Failed asserting that false is true.

C:\wamp64\www\Nueva carpeta\veterinaria\tests\Cliente\Dominio\ObjetoValor\TelefonoTest.php:41

FAILURES!
Tests: 5, Assertions: 8, Failures: 1.
